Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: དགའ་ཏོག་སྒྲ་གཅན་ལྷ་དང་ན་ཚོད་བཟང་། །ལྷ་དག་དགའ་དང་རིན་ཆེན་ཕུང་པོ་དང་། །མཛེས་པར་གཤེགས་དང་སེང་གེའི་ཕྱོགས་པ་དང་། །ཤིན་ཏུ་མཐོར་གཤེགས་སྐྱེ་དབང་བློ་གྲོས་བཟང་། །
en: Priyaketu,Rāhudeva, Suvayas, “Amarapriya, Ratnaskandha, Laḍitavikrama, Siṃhapakṣa, Atyuccagāmin, Janendra, Sumati,

source: འཇིག་རྟེན་འོད་དང་རིན་ཆེན་གཟི་བརྗིད་དང་། །སྐལ་ལྡན་ཤིང་རྟ་ཀུན་རྒྱལ་དགའ་བ་བཀོད། །སྟེགས་མཛད་དང་ནི་སྤོས་གླང་བློ་འོད་འཕྲོ། །རི་བོའི་རྒྱལ་མཚན་དང་ནི་སྤོས་བཟངས་དང་། །
en: Lokaprabha, Ratnatejas, “Bhāgīrathi, Saṃjaya, Rativyūha, Tīrthakara, Gandhahastin, Arciṣmati, Merudhvaja, Sugandha,

source: ཆོས་བརྟན་དང་ནི་གཟི་བརྗིད་དྲག་ཤུལ་ཅན། །ཆོས་ཀྱི་ནོར་བུ་བཟང་བྱིན་བདེ་གཤེགས་ཟླ། །ཚངས་པའི་དབྱངས་དང་སེང་གེའི་ཟླ་བ་དཔལ། །ལེགས་པར་སྐྱེས་དང་ཐུབ་པ་མེད་པའི་ཚོགས། །
en: Dṛḍhadharma, Ugratejas, “Maṇidharman, Bhadradatta, the thus-gone Candra, Brahmasvara, Siṃhacandra, Śrī, Sujāta, Ajitagaṇa,

source: གྲགས་པའི་བཤེས་གཉེན་བདེན་པ་ཞེས་བྱ་དང་། །དཀའ་ཐུབ་ཆེན་པོ་ལྷུན་པོའི་འོད་ཟེར་དང་། །ཡོན་ཏན་བརྩེགས་པ་མཆོད་གྲགས་ཆོས་གྲགས་དང་། །སྦྱིན་འོད་གློག་འབྱིན་བདེན་པར་གསུང་བ་དང་། །
en: Yaśomitra, Satya, “Mahātapas, Meruraśmi, Guṇakūṭa, Arhadyaśas, Dharmakīrti, Dānaprabha, Vidyuddatta, Satyakathin,

source: འཚོ་བྱེད་ན་ཚོད་བཟང་པོ་ལེགས་ཚོགས་ཅན། །རྣམ་ངེས་བློ་གྲོས་སྲིད་མཐའ་ནོར་བུའི་སྤོས། །རྒྱལ་བས་དགྱེས་དང་སེང་གེའི་འོད་ཟེར་དང་། །རྣམ་པར་སྣང་མཛད་གྲགས་མཆོག་ཐུགས་རབ་གཞུངས། །
en: Jīvaka, Suvayas, Sadgaṇin, “Viniścitamati, Bhavānta­maṇi­gandha, Jayanandin, Siṃharaśmi, Vairocana, Yaśottara, Sumedhas,

source: ནོར་བུ་ཟླ་བ་དྲག་ཤུལ་འོད་ཟེར་དང་། །བརྟུལ་ཞུགས་ཐུབ་མེད་འགྲོས་མཆོད་ནོར་བུའི་ཚོགས། །འཇིག་རྟེན་བླ་མ་གླང་ཆེན་སེང་གེ་དང་། །ཟླ་བ་རིན་ཆེན་འོད་ཟེར་སྒྲ་གཅན་སྦེད། །
en: Maṇicandra, Ugraprabha, “Anihatavrata, Jagatpūjita, Maṇigaṇa, Lokottara, Siṃhahastin, Candra, Ratnārci, Rāhuguhya,

source: ཡོན་ཏན་རྒྱ་མཚོ་འོད་ཟེར་ལྡན་པ་དང་། །རབ་ཏུ་ཞི་སྟབས་འཇིག་རྟེན་བཟང་པོ་དང་། །མྱ་ངན་མེད་པ་ཤུགས་བཅུ་སྟོབས་དགྱེས་དང་། །མཐུ་ཡི་དཔལ་དང་མཐུ་ཐོབ་མཐུ་ཆེན་དང་། །
en: Guṇasāgara, Sahitaraśmi, “Praśāntagati, Lokasundara, Aśoka, Daśavaśa, Balanandin, Sthāmaśrī, Sthāmaprāpta, Mahāsthāman,

source: ཡོན་ཏན་སྙིང་པོ་བདེན་པར་སྤྱོད་པ་དང་། །དགེ་མཆོག་རྒྱལ་པོ་སྐར་རྒྱལ་འོད་ཟེར་ཆེ། །གློག་གི་འོད་དང་ཡོན་ཏན་རྒྱ་ཆེན་དང་། །རིན་པོ་ཆེ་དང་དཔལ་འོད་བདུད་འདུལ་དང་། །
en: Guṇagarbha, Satyacara, “Kṣemottamarāja, Tiṣya, Mahāraśmi, Vidyutprabha, Guṇavisṛta, Ratna, Śrīprabha, Māradama,

source: གོ་བགོས་སེང་གེའི་ཕྱག་དང་མེ་ཏོག་བཟང་། །རིན་ཆེན་མཐོན་པོ་དང་ནི་རྒྱ་མཚོ་དང་། །ས་འཛིན་དོན་བློ་མངའ་བ་ཡོན་ཏན་བསགས། །ཡོན་ཏན་ཚོགས་དང་རིན་པོ་ཆེ་ཡི་མེ། །
en: Kṛtavarman, Siṃhahasta, Supuṣpa, “Ratnottama, Sāgara, Dharaṇīdhara, Arthabuddhi, Guṇagaṇa, Guṇagaṇa, Ratnāgni,

source: འཇིག་རྟེན་འདས་དང་འཇིག་རྟེན་ཟླ་བ་དང་། །དབྱངས་སྙན་ཚངས་པའི་ཏོག་དང་ཚོགས་ཆེན་གཙོ། །སེང་གེའི་སྟབས་དང་དྲག་ཤུལ་བྱིན་པ་དང་། །ཆོས་ཀྱི་དབང་ཕྱུག་གཟི་འོད་འོད་ཟེར་ཆེ། །
en: Lokāntara, Lokacandra, “Madhura­svara­rāja, Brahmaketu, Gaṇimukha, Siṃhagati, Ugradatta, Dharmeśvara, Tejasprabha, Mahāraśmi,

source: རིན་ཆེན་གྲགས་པ་ཚོགས་ཅན་གསལ་བ་དང་། །གྲགས་པ་མཐའ་ཡས་འོད་ཟེར་དོན་ཡོད་དང་། །ལྷ་ཡི་དྲང་སྲོང་སྐྱེ་དབང་དགེ་འདུན་བརྟན། །ཕྱོགས་བཟང་ཏོག་དང་ཡུལ་འཁོར་མེ་ཏོག་དང་། །
en: Ratnayaśas, Gaṇiprabhāsa, “Anantayaśas, Amogharaśmi, Ṛṣideva, Janendra, Dṛḍhasaṅgha, Supakṣa, Ketu, Kusumarāṣṭra,

source: ཆོས་ཀྱི་བློ་གྲོས་རླུང་གི་ཤུགས་ལྟར་གཤེགས། །ལེགས་བསམས་གྲགས་པ་སྣང་ལྡན་ལྷ་ཚོགས་དང་། །ཡོན་ཏན་བསྲུངས་དོན་བློ་གྲོས་བསྙེངས་པ་མེད། །གྲོགས་བརྟན་དང་ནི་འོད་གནས་མཚུངས་པ་དང་། །
en: Dharmamati, Anilavegagāmin, “Sucittayaśas, Dyutimat, Marutskandha, Guṇagupta, Arthamati, Abhaya, Sthitamitra, Prabhāsthita­kalpa,

source: ནོར་ཞབས་ཐར་པའི་གཟི་བརྗིད་ངོས་བཟངས་དང་། །བློ་བཟངས་དང་ནི་ཀུན་དུ་གཟི་བརྗིད་དང་། །ཡེ་ཤེས་མཆོག་མ་དང་ནི་ཚངས་པར་གནས། །བདེན་པ་གསུང་དང་བློ་བཟངས་སྟོབས་བྱིན་དང་། །
en: Maṇicaraṇa, Mokṣatejas, Sundarapārśva, “Subuddhi, Samantadarśin, Jñānavara, Brahmavāsa, Satyaruta, Subuddhi, Baladatta,

source: སེང་སྟབས་མེ་ཏོག་ཏོག་དང་ཤེས་འབྱུང་གནས། །མེ་ཏོག་བྱིན་དང་ཡོན་ཏན་སྙིང་པོ་དང་། །རིན་ཆེན་གྲགས་པ་གྲགས་པ་རྨད་བྱུང་དང་། །མི་ཚུགས་བསྙེངས་མེད་ཉི་མའི་འོད་དག་དང་། །
en: Siṃhagati, Puṣpaketu, Jñānākara, “Puṣpadatta, Guṇagarbha, Yaśoratna, Adbhutayaśas, Anihata, Abhaya, Sūryaprabha,

source: ཚངས་གཤེགས་ལྷ་ཡི་མཐུ་རྩལ་ཡེ་ཤེས་དགྱེས། །ལྷ་བདེན་ནོར་བུའི་སྙིང་པོ་ཡོན་ཏན་གྲགས། །ཡེ་ཤེས་དཔལ་དང་བཅིངས་པ་མེད་པ་དང་། །བརྟུལ་ཤུགས་བརྟན་དང་ལྷ་ཡི་གཟི་བརྗིད་དང་། །
en: Brahmagāmin, Vikrāntadeva, Jñānapriya, “Satyadeva, Ratnagarbha, Guṇakīrti, Jñānaśrī, Asita, Dṛḍhavrata, Maruttejas,

source: ཚངས་ཐུབ་དལ་བཞུད་བརྟུལ་ཞུགས་དཀའ་ཐུབ་དང་། །འོད་ཟེར་ཕུང་པོ་དང་ནི་གཟི་བརྗིད་ཆེ། །ཙམ་པ་ཀ་དང་དགའ་མཛད་ཚོགས་ཅན་བཟང་། །དབང་པོའི་རྒྱལ་མཚན་བཅུ་པ་དགྱེས་ཆེན་ཡིན། །
en: Brahmamuni, Śanairgāmin, Vratatapas, “Arciskandha, Mahātejas, Campaka, Toṣaṇa, Sugaṇin, Indradhvaja, the tenth, Mahāpriya,

source: སྣ་མའི་མེ་ཏོག་འོད་དང་ཚོགས་ཅན་འོད། །སྐྲུན་མཛད་མདངས་འགྲོ་དོན་ལེགས་ངེས་པ་དང་། །ཁྱུ་མཆོག་དང་ནི་ལག་བཟངས་འོད་ཟེར་ཆེ། །བསམ་པས་བྱིན་པ་དང་ནི་བསོད་ནམས་འོད། །
en: Sumanā­puṣpa­prabha, Gaṇiprabha, “Creator, Ojaṅgama, Suviniścitārtha, Vṛṣabha, Subāhu, Mahāraśmi, Āśādatta, Puṇyābha,

source: རིན་ཆེན་དབྱངས་དང་རྡོ་རྗེའི་སྡེ་དང་ནི། །འབྱོར་ལྡན་སེང་གེའི་སྟོབས་དང་དྲི་མེད་སྤྱན། །འོད་སྲུང་དང་ནི་བློ་གསལ་ཡེ་ཤེས་འགྲོས། །གཟི་བརྗིད་དྲག་ཤུལ་འོད་ཟེར་ཆེན་པོ་དང་། །
en: Ratnaruta, Vajrasena, “Samṛddha, Siṃhabala, stainless Netra, Kāśyapa, Prasannabuddhi, Jñānakrama, Ugratejas, Mahāraśmi,

source: ཉི་མའི་འོད་དང་དྲི་མ་མེད་པའི་འོད། །གཟི་བརྗིད་རྣམ་འབྱེས་ཁེངས་མེད་སྦྲང་རྩིའི་ཞལ། །ཟླ་འོད་གློག་འབྱིན་རབ་ཞིར་གཤེགས་པ་དང་། །མི་འཁྲུགས་པ་དང་དགྲ་བཅོམ་གྲགས་པ་དང་། །
en: Sūryaprabha, Vimalaprabha, “Vibhaktatejas, Anuddhata, Madhuvaktra, Candraprabha, Vidyuddatta, Praśāntagāmin, Akṣobhya, Arhatkīrti,

source: ཆོས་ཀྱི་ཡོན་ཏན་ཞིང་བཟང་བཀོད་རྒྱལ་པོ། །མངོན་པར་འཕགས་དང་སྦྱིན་བསྲེག་འོད་འཕྲོ་དང་། །པད་དཔལ་རིན་ཆེན་བཀོད་དང་ཤིན་ཏུ་བཟང་། །རིན་ཆེན་མཆོག་དང་ཐུགས་ནི་ཤིན་ཏུ་གཞུངས། །
en: Guṇadharma, Laḍitakṣetra, Vyūharāja, “Abhyudgata, Hutārci, Padmaśrī, Ratnavyūha, Subhadra, Ratnottama, Sumedhas,

source: རྒྱ་མཚོས་བྱིན་དང་ཚངས་པའི་ཏོག་དང་ཟླ་གདུགས་འོད་འཕྲོ་དང་། །དྲི་མེད་རྒྱལ་པོ་ཡེ་ཤེས་གྲགས་པ་ཀུན་རྒྱལ་ཡོན་ཏན་འོད། །སྒྲ་གྲགས་ཟླ་རྒྱལ་པད་མའི་འོད་ཟེར་བརྟུལ་ཞུགས་བཟང་པོ་དང་། །སྒྲོན་རྒྱལ་གློག་གི་ཏོག་དང་འོད་ཟེར་རྒྱལ་པོ་སྐར་མཁན་དང་། །
en: Samudradatta, Brahmaketu, Somacchattra, Arciṣmat, “Vimalarāja, Jñānakīrti, Saṃjaya, Guṇaprabha, Vighuṣṭaśabda, Pūrṇacandra, Padmaraśmi, Suvrata, Pradīparāja, Vidyutketu, Raśmirāja, Jyotiṣka,

source: གྲགས་པ་རྫོགས་ལྡན་པད་མའི་སྙིང་པོ་རྒྱལ་དང་སྤྱན་མཛེས་དང་། །རྙོག་པ་མེད་དོན་དྲག་ཤུལ་སྡེ་དང་བསོད་ནམས་གཟི་མཐུ་རྩལ། །ཐོགས་མེད་བློ་དང་སྒྲ་གཅན་ལྷ་དང་ཤེས་ཕུང་ཁ་ལོ་སྒྱུར། །སྐྱེ་དབང་མཚུངས་དང་མེ་ཏོག་ཏོག་དང་སྒྲ་གཅན་འཛིན་སྨན་ཆེན། །
en: Saṃpannakīrti, Padmagarbha, Puṣya, Cārulocana, “Anāvilārtha, Ugrasena, Puṇyatejas, Vikrama, Asaṅgamati, Rāhudeva, Jñānarāśi, Sārathi, Janendrakalpa, Puṣpaketu, Rāhula, Mahauṣadhi,

source: རྒྱུ་སྐར་རྒྱལ་པོ་སྨན་རྒྱལ་བསོད་ནམས་གླང་པོ་གཅོད་མཛད་དང་། །རྣམ་གྲགས་རྒྱལ་པོ་ཉི་འོད་ཆོས་མཛོད་བློ་གྲོས་བཟང་། །ཡོན་ཏན་དབང་མཚུངས་རྡོ་རྗེའི་སྡེ་དང་ཤེས་རབ་བརྩེགས་པ་དང་། །ལེགས་གནས་བློ་སྦྱངས་ཚངས་དབྱངས་ཡོན་ཏན་མཆོག་དང་འབྲུག་སྒྲ་དབྱངས། །
en: Nakṣatrarāja, Vaidyarāja, Puṇyahastin, Chedana, “Vighuṣṭarāja, Sūryaraśmi, Dharmakośa, Sumati, Guṇendrakalpa, Vajrasena, Prajñākūṭa, Susthita, Cīrṇabuddhi, Brahmaghoṣa, Guṇottama, Garjitasvara,

source: མངོན་ཤེས་ཏོག་དང་ཏོག་འོད་དགེ་བ་ཚངས་པ་སྐྱེས་མཆོག་དང་། །སྤྱན་སྡུག་པ་དང་ཀླུས་བྱིན་བདེན་པའི་ཏོག་དང་བརྒྱན་པ་དང་། །ཞུམ་པ་མེད་དབྱངས་རིན་ཆེན་འོད་དང་ཚངས་བྱིན་སེང་གེ་དང་། །འོད་ཟེར་སྣ་ཚོགས་ཡེ་ཤེས་དཔའ་བོ་པད་ཕུང་མེ་ཏོག་རྒྱས། །
en: Abhijñāketu, Ketuprabha, Kṣema, Brahmā, Puṃgava, “Laḍitanetra, Nāgadatta, Satyaketu, Maṇḍita, Adīnaghoṣa, Ratnaprabha, Ghoṣadatta, Siṃha, Citraraśmi, Jñānaśūra, Padmagarbha, Puṣpita,

source: མཐུ་རྩལ་སྟོབས་དང་བསོད་ནམས་ཕུང་པོ་གཟུགས་མཆོག་སྐར་མཁན་དང་། །ཟླ་སྒྲོན་གཟི་བརྗིད་ཕུང་པོ་བྱང་ཆུབ་རྒྱལ་པོ་མི་ཟད་པ། །མངོན་རྟོགས་སྤྱན་དང་ཡན་ལག་རྒྱས་དང་ཡུལ་འཁོར་ཤེས་རབ་མཆོག །གཟི་བརྗིད་ཚིམ་མཛད་ཤེས་རབ་བྱིན་དང་མགོན་པོ་འཇམ་པའི་དབྱངས། །
en: Vikrāntagamin, Puṇyarāśi, Śreṣṭharūpa, Jyotiṣka, “Candrapradīpa, Tejorāśi, Bodhirāja, Akṣaya, Subuddhinetra, Pūritāṅga, Prajñārāṣṭra, Uttama, Toṣitatejas, Prajñādatta, Nātha, Mañjughoṣa,

source: ཆགས་པ་མེད་མཛོད་གཙོ་བོས་བྱིན་དང་གཙོ་བོ་ཤེས་མཐུ་རྩལ། །འོད་འཕྲོ་དབང་པོ་ཤུགས་འཆང་སྐར་རྒྱལ་འོད་བཟངས་གྲགས་པ་བྱིན། །གཟུགས་བཟང་རྒྱལ་པོ་དོན་གྲུབ་སེང་གེའི་སྡེ་དང་ནོར་ལྷའི་བུ། །གྲགས་རྒྱལ་རྒྱ་ཆེན་སྙིང་པོ་བསོད་ནམས་འོད་ཟེར་སྨྲང་འདོན་པ། །
en: Asaṅgakośa, Jyeṣṭhadatta, Śreṣṭha, Jñānavikrama, “Arciṣmat, Indra, Vegadhārin, Tiṣya, Suprabha, Yaśodatta, Surūpa, Rājan, Arthasiddhi, Siṃhasena, Vāsava, Yaśas, Jaya, Udāragarbha, Puṇyaraśmi, Śrotriya,

source: སྒྲོན་རྒྱལ་ཡེ་ཤེས་བརྩེགས་དང་ལྷ་མཆོག་དང་ནི་ས་བདག་དང་། །གྲོལ་བརྙེས་གཙུག་གི་གསེར་དང་སྒྲ་གཅན་བཟང་པོ་ཐུབ་པར་དཀའ། །ཐུབ་གསལ་ཟླ་བའི་འོད་ཟེར་གསེར་གྱི་འོད་དང་ལེགས་བྱིན་ལྷའི། །ཡོན་ཏན་དབང་པོ་ཆོས་གདུགས་བསོད་ནམས་ལག་དང་ཆགས་མེད་དང་། །
en: Pradīparāja, Jñānakūṭa, Uttamadeva, Pārthiva, “Vimuktilābhin, Suvarṇacūḍa, Rāhubhadra, Durjaya, Muniprasanna, Somaraśmi, Kāñcanaprabha, Sudatta, Guṇendradeva, Dharmacchattra, Puṇyabāhu, Asaṅga,

source: ཡེ་ཤེས་གྱ་ནོམ་བློ་ཞིབ་གཟི་བྱིན་ཐམས་ཅད་པ་རྩི་སྨན། །རྣམ་གྲོལ་ཏོག་དང་འོད་མཛོད་ཡེ་ཤེས་རྒྱལ་པོ་འཇིགས་མཛད་དང་། །ཆུ་བོ་སྤོང་དང་ཐོགས་མེད་གྲགས་པ་བདེན་ཕུང་དབྱངས་སྙན་དང་། །རི་དབང་མཚུངས་དང་ཆོས་བརྩེགས་ཐར་པའི་གཟི་བརྗིད་ལེགས་མཛད་དང་། །
en: Prāṇītajñāna, Sūkṣmabuddhi, Sarvatejas, Oṣadhi, “Vimuktaketu, Prabhākośa, Jñānarāja, Bhīṣaṇa, Oghajaha, Asaṅgakīrti, Satyarāśi, Susvara, Girīndrakalpa, Dharmakūṭa, Mokṣatejas, Śobhita,

source: རབ་ཞིའི་སྐུ་དང་ཡིད་འོང་གསུང་བློ་སྦྱངས་དང་ཆུ་ལྷ་དང་། །འགྲོས་མཆོད་སེང་གེའི་ལོགས་དང་ཆོས་ཀྱི་མཐུ་རྩལ་སྐལ་བཟང་པོ། །མི་འཁྲུགས་མདོག་དང་གཟི་བརྗིད་རྒྱལ་པོ་རྟོགས་མཛད་སྤྱན་ལེགས་དང་། །དོན་གནས་བློ་དང་སྣང་བའི་འོད་ཟེར་སྤོས་གཟིའི་ཀུན་དགའ་མཛད། །
en: Praśāntagātra, Manojñavākya, Cīrṇabuddhi, Varuṇa, “Jagatpūjita, Siṃhapārśva, Dharmavikrāmin, Subhaga, Akṣobhyavarṇa, Tejorāja, Bodhana, Sulocana, Sthitārtha­buddhi, Ābhāsaraśmi, Gandhatejas, Saṃtoṣaṇa,

source: དོན་ཡོད་གཤེགས་དང་ཁྲོ་བ་བཅོམ་དང་གཟུགས་མཆོག་ལེགས་གཤེགས་དང་། །རབ་སྦྱིན་གྲགས་དང་འོད་གཙང་ལྷ་ཡི་ཉི་མ་ཤེས་རབ་བྱིན། །མཉམ་གཞག་བདག་ཉིད་གཟི་མདངས་རྒྱལ་རིགས་སྐལ་ལྡན་ཤིང་རྟ་དང་། །གསེར་མཆོག་རྣམ་གྲོལ་གཙུག་དང་ཆོས་ལྡན་དང་ནི་སྤོས་གནས་དང་། །
en: Amoghagāmin, Bhasmakrodha, Vararūpa, Sukrama, “Pradānakīrti, Śuddhaprabha, Devasūrya, Prajñādatta, Samāhitātman, Ojastejas, Kṣatriya, Bhāgīrathi, Suvarṇottama, Vimuktacūḍa, Dhārmika, Sthitagandha,

source: དྲེགས་སྤངས་ཡེ་ཤེས་མཛོད་དང་ཚངས་པར་གཤེགས་དང་ཙན་དན་དང་། །མྱ་ངན་མེད་དང་སེང་གེའི་འོད་ཟེར་ཡུལ་འཁོར་ཏོག་པད་སྙིང་། །གཟི་བརྗིད་མཐའ་ཡས་ལྷ་འོད་ཤེས་རབ་མེ་ཏོག་མཁས་པ་དང་། །ཡེ་ཤེས་འབྱོར་ལྡན་ཚངས་དབྱིག་ཕྱག་ན་རིན་ཆེན་དབང་ལྡན་དང་། །
en: Madaprahīṇa, Jñānakośa, Brahmagāmin, Candana, “Aśoka, Siṃharaśmi, Keturāṣṭra, Padmagarbha, Anantatejas, Devaraśmi, Prajñāpuṣpa, Vidvat, Samṛddhajñāna, Brahmavasu, Ratnapāṇi, Indrama,

source: རྫོགས་པར་གསུང་དང་མཆོག་གསུང་མཆོད་འོས་སྐར་རྒྱལ་ཉི་མ་དང་། །འདམ་བརྒལ་ཡེ་ཤེས་བརྙེས་དང་གྲུབ་པ་རྨ་བྱ་ཆོས་སྦྱིན་དང་། །ཕན་བཞེད་ཡེ་ཤེས་ལྡན་གྲགས་འོད་ཟེར་དྲ་བ་རྣམ་བཅོམ་དང་། །བཻ་དཱུརྱ་སྙིང་མེ་ཏོག་ལྷ་རྒྱལ་ཟླ་བ་དྲན་འོད་དང་། །
en: Anupamavādin, Jyeṣṭhavādin, Pūjya, Tiṣya, Sūrya, “Uttīrṇapaṅka, Jñānaprāpta, Siddhi, Mayūra, Dharmadatta, Hitaiṣin, Jñānin, Yaśas, Raśmijāla, Vijita, Vaiḍūryagarbha, Puṣpa, Devarāja, Śaśin, Smṛtiprabha,

source: དགེ་བའི་འོད་དང་ཡོན་ཏན་མཆོག་མ་ཀུན་གྱི་འོད། །རིན་པོ་ཆེ་ཡི་དཔལ་དང་སྐྱེས་བུ་ཟླ་བ་དང་། །སྒྲ་གཅན་བདུད་རྩིའི་འོད་དང་འཇིག་རྟེན་དག་གི་མཆོག །སྐར་འོད་ཞི་སྟོབས་བཅུ་པ་ཡེ་ཤེས་རྒྱ་མཚོ་ཡིན། །
en: Kuśalaprabha, Sarva­vara­guṇa­prabha, “Ratnaśrī, Manuṣyacandra, Rāhu, Amṛtaprabha, Lokajyeṣṭha, Jyotiṣprabha, Śāntagati, the tenth, Jñānasāgara,

source: རི་དབང་རབ་ཞི་ཡོན་ཏན་མཐུ་སྟོབས་ལྷ་དབང་དང་། །དབྱངས་སྙན་ངོས་བཟངས་དང་ནི་དོན་ལ་གནས་པ་དང་། །ཡོན་ཏན་གཟི་བརྗིད་དཔལ་དང་མཁྱེན་ལྡན་ཟླ་མེད་དང་། །བཅུ་པ་ང་རོ་དཔག་མེད་རྒྱལ་བ་ཞེས་ཀྱང་བྱ། །
en: Parvatendra, Praśānta, Guṇabala, Deveśvara, “Mañjughoṣa, Supārśva, Sthitārtha, Guṇatejas, Anuttarajñānin, The tenth victorious one, Amitasvara,

source: འོད་བཟངས་ཤིན་ཏུ་ཐུགས་གཞུངས་དོན་དགོངས་གཏི་མུག་བྲལ། །དབྱངས་ཀྱི་ཡན་ལག་ཁྱད་འཕགས་མཆོག་ཏུ་མཛེས་པར་གཤེགས། །ཞི་བའི་དོན་དང་སྐྱོན་མེད་བློ་དབྱངས་དགེ་བ་དང་། །པད་མའི་མཛོད་དང་བཅུ་པ་འོད་ཟེར་བཟང་པོ་ཡིན། །
en: Sukhābha, Sumedhas, Vigata­mohārtha­cintin, “Viśiṣṭa­svarāṅga, Laḍitāgragāmin, Śāntārtha, Adoṣa, Śubha­cīrṇa­buddhi, Padmakośa, the tenth, Suraśmi,

source: སྤོབས་པའི་མཆོག་དང་སྟེགས་བཟང་པོ་དང་ཚོགས་དབང་དང་། །བསྙེངས་པ་དང་ནི་བྲལ་བ་ཡེ་ཤེས་བཞེད་པ་དང་། །བདེ་གཤེགས་སྤོབས་པའི་སྤྱན་དང་བློ་ཡི་མཆོག་མ་དང་། །ཟླ་བ་རིན་ཆེན་ཟླ་འོད་དང་ནི་བཅུ་པ་བསྙེངས་མེད་ཡིན། །
en: Pratibhāna­varṇa, Sutīrtha, Gaṇendra, “Vigatabhaya, Jñānaruci, The well-gone Pratibhāna­cakṣus, Varabuddhi, Candra, Ratnābhacandra, and the tenth, Abhaya,

source: གཟིགས་པ་ཆེ་དང་ཚངས་པའི་དབྱངས་དང་དབྱངས་བཟང་དང་། །ཤེས་རབ་ཆེན་པོའི་སྟེགས་དང་བློ་གྲོས་ཟླ་མེད་དང་། །རྡོ་རྗེ་མཁྲེགས་དང་བྱང་ཆུབ་བློ་གྲོས་ལྗོན་ཤིང་དབང་། །གདངས་སྙན་པ་དང་བཅུ་པ་བསོད་ནམས་སྟོབས་ཀྱང་ཡིན། །
en: Mahādarśana, Brahmaruta, Sughoṣa, “Mahā­prajñā­tīrtha, Asamabuddhi, Acalaprajñābha, Buddhimati, Drumendra, Ghoṣasvara, the tenth, Puṇyabala,

source: མཐུ་ཡི་དཔལ་དང་འཕགས་པ་དགྱེས་དང་མཐུ་སྟོབས་དང་། །སྐར་མ་ལ་ནི་དགྱེས་དང་སྤྲིན་གྱི་རྔ་སྒྲ་དང་། །སྤྱན་སྡུག་ཞལ་དང་ཡེ་ཤེས་བཟང་ལྡན་འབྱོར་ལྡན་དང་། །ཡོན་ཏན་ཕུང་པོ་དང་ནི་བཅུ་པ་གསལ་བ་ཡིན། །
en: Sthāmaśrī, Āryapriya, Pratapta, “Jyotīrāma, Dundubhi­megha­svara, Priya­cakṣurvaktra, Sujñāna, Samṛddha, Guṇarāśi, the tenth, Prasanna,

source: ཆོས་ཀྱི་རྒྱལ་མཚན་ཡེ་ཤེས་ང་རོ་ནམ་མཁའ་དང་། །མཆོད་སྦྱིན་ང་རོ་ཤེས་རབ་རྣམ་འགོད་ང་རོ་དང་། །ཡོན་ཏན་འོད་ཟེར་གཟི་བརྗིད་དྲང་སྲོང་དབང་པོ་དང་། །བློ་ལྡན་སྤོབས་པའི་ཚོགས་དང་བཅུ་པ་མཆོད་སྦྱིན་བཟང་། །
en: Dharmadhvaja, Jñānaruta, Gagana, “Yajñasvara, Jñāna­vihāsa­svara, Guṇatejoraśmi, Ṛṣīndra, Matimat, Pratibhānagaṇa, the tenth, Suyajña,

source: ཟླ་བའི་ཞལ་དང་ཤིན་ཏུ་གཟིགས་དང་རྡུལ་བྲལ་དང་། །ཡོན་ཏན་ཚོགས་དང་ཏོག་ལྡན་བསོད་ནམས་རྒྱལ་མཚན་དང་། །ཡུལ་འཁོར་སྤོབས་པ་དང་ནི་རིན་ཆེན་རབ་སྦྱིན་དང་། །ཟླ་བ་དགྱེས་པ་དང་ནི་བཅུ་པ་སེང་གེའི་སྟོབས། །
en: Candrānana, Sudarśana, Viraja, “Guṇasañcaya, Ketumat, Puṇyadhvaja, Pratibhāna­rāṣṭra, Ratnapradatta, Priyacandra, the tenth, Siṃhabala,

source: དབང་སྒྱུར་རྒྱལ་པོ་དང་ནི་བདུད་རྩི་གསལ་བ་དང་། །བསམ་གཏན་སྙོམས་དང་འཁྲུག་མེད་དྲི་མ་རབ་ཞི་དང་། །ཕྱོགས་མ་བསླད་དང་མཛེས་པ་དང་ནི་ཞལ་བཟངས་དང་། །ཤུགས་གནས་ཡེ་ཤེས་ལྡན་དང་བཅུ་པ་གསུང་དབང་ཡིན། །
en: Vaśavartirāja, Amṛtaprasanna, “Samadhyāyin, Akṣobhya, Praśāntamala, Deśāmūḍha, Laḍita, Suvaktra, Sthita­vega­jñāna, the tenth, Kathendra,

source: གཟི་བརྗིད་ཆེན་པོ་བློ་གྲོས་ཟབ་མོ་བདུད་རྩི་དང་། །ཆོས་ཀྱི་སྟོབས་དང་མཆོད་པར་ལྡན་དང་མེ་ཏོག་འོད། །ཁམས་གསུམ་དག་གི་མཆོད་གནས་སྒྲ་གཅན་ཉི་མའི་སྙིང་། །ལྷ་ཡིས་མཆོད་པ་བཅུ་པ་ཐར་པའི་རྒྱལ་མཚན་ཡིན། །
en: Mahātejas, Gambhīramati, Amṛta, “Dharmabala, Pūjya, Puṣpaprabha, Trailokyapūjya, Rāhu­sūrya­garbha, Marutpūjita, the tenth, Mokṣadhvaja,

source: དགེ་བའི་གཙུག་དང་བདུད་རྩིའི་འོད་དང་རྡོ་རྗེ་དང་། །བརྟན་པ་དང་ནི་རིན་ཆེན་ཕུང་པོ་མཛེས་གཤེགས་དང་། །ཉི་མ་ལྟ་བུར་གཤེགས་པ་དང་ནི་དག་པའི་འོད། །ཡོན་ཏན་གཙུག་དང་བཅུ་པ་དཔལ་ནི་རྫོགས་པ་དང་། །
en: Kalyāṇacūḍa, Amṛtaprabha, Vajra, “Dṛḍha, Ratnaskandha, Laḍitakrama, Bhānumat, Śuddhaprabha, Guṇacūḍa, the tenth, Anupamaśrī,

source: སེང་གེའི་སྟབས་དང་གྱེན་དུ་འཕགས་པ་མེ་ཏོག་བྱིན། །འོད་འགྱེད་པ་དང་པད་མ་དང་ནི་ཡེ་ཤེས་དགྱེས། །བཀོད་པ་མཛེས་དང་གཏི་མུག་མེད་པར་གནས་པ་དང་། །རྨ་མེད་པ་དང་བཅུ་པ་ཏོག་གི་རྒྱལ་མཚན་ཡིན། །
en: Siṃhagati, Udgata, Puṣpadatta, “Muktaprabha, Padma, Jñānapriya, Laḍitavyūha, Amohavihārin, Avraṇa, the tenth, Ketudhvaja,

source: བདེ་བར་དགོངས་དང་གཏི་མུག་མེད་རྒྱལ་ཆོ་ག་མཁྱེན། །དག་པའི་རྒྱ་མཚོ་དང་ནི་རིན་ཆེན་མངའ་དང་མི་དམའ་བ། །སྐྱེ་བོ་དགའ་མཛད་རྨ་བྱའི་ང་རོ་མ་ཞུམ་དང་། །བཅུ་པ་སྲིད་པའི་སྲེད་པ་དྲི་མ་སྤངས་པ་ཡིན། །
en: Sukhacittin, Vimoharāja, Vidhijña, “Śuddhasāgara, Ratnadhara, Anavanata, Jagattoṣaṇa, Mayūraruta, Adīna, The tenth, Bhava­tṛṣṇā­mala­prahīṇa,

source: སྤྱོད་པའི་སྟེགས་དང་ལྷ་མང་དག་གིས་སྙན་བསྒྲགས་པ། །རིན་པོ་ཆེ་ཡི་སྟབས་དང་ཕྱག་ན་པད་བསྣམས་དཔལ། །དགྲ་ལས་རྒྱལ་དང་འབྱོར་ལྡན་གྲགས་པ་ཡུལ་འཁོར་བཟང་། །མེ་ཏོག་འོད་དང་བཅུ་པ་སེང་གེའི་ང་རོ་ཡིན། །
en: Cāritratīrtha, Bahudevaghuṣṭa, “Ratnakrama, Padmahastin, Śrī, Jitaśatru, Samṛddhayaśas, Surāṣṭra, Kusumaprabha, the tenth, Siṃhasvara,

source: ཟླ་ལྟར་ཤར་དང་འཇོམས་པའི་མཆོག་དང་མི་གཡོ་དང་། །ཕན་ལྡན་གཤེགས་དང་བསོད་ནམས་སྒྲོན་མའི་རྒྱལ་པོ་དང་། །དབྱངས་ཀྱིས་བསྐུལ་དང་གཽ་ཏ་མི་དང་མདངས་སྟོབས་དང་། །བློ་གནས་རང་བཞིན་དང་ནི་བཅུ་པ་ཟླ་བ་བཟང་། །
en: Candrodgata, Damajyeṣṭha, Acala, “Upakāragati, Puṇya­pradīpa­rāja, Svaracodaka, Gautama, Ojobala, Sthita­buddhi­rūpa, the tenth, Sucandra,

source: བྱང་ཆུབ་ཡན་ལག་མེ་ཏོག་བཀྲ་ཤིས་ལེགས་སྟོན་དང་། །ཡེ་ཤེས་གཟི་བརྗིད་སྟོབས་དང་དགེ་བའི་སྒྲོན་མ་དང་། །མཐུ་རྩལ་བརྟན་པོ་ལྷ་ཡི་སྒྲ་དང་རབ་ཞི་དང་། །ཉི་མའི་ཞལ་དང་བཅུ་པ་ཐར་པའི་བརྟུལ་ཞུགས་ཡིན། །
en: Bodhyaṅgapuṣpa, Siddhi, Praśasta, “Balatejojñāna, Kuśalapradīpa, Dṛḍhavikrama, Devaruta, Praśānta, Sūryānana, the tenth, Mokṣavrata,

source: ཚུལ་ཁྲིམས་འོད་དང་བརྟུལ་ཞུགས་གནས་པ་རྡུལ་མེད་དང་། །སྙིང་པོ་འཕགས་དང་མིག་སྨན་འཕེལ་བར་མཛད་པ་དང་། །སྤོས་འོད་དུས་མཁྱེན་འོད་དང་དྲན་པའི་དབང་པོ་དང་། །ཐོགས་མེད་རྒྱལ་མཚན་བཅུ་པ་བྱང་ཆུབ་མཆོག་བགྲོད་ཡིན། །
en: Śīlaprabha, Vratasthita, Arajas, “Sārodgata, Añjana, Vardhana, Gandhābha, Velāmaprabha, Smṛtīndra, Asaṅgadhvaja, the tenth, Varabodhigati,

source: སྤྱོད་གསལ་རིན་ཆེན་དགྱེས་དང་ཆོས་དབང་ཕྱུག །ལྷ་ཐམས་ཅད་པ་བཤེས་གཉེན་ཆེན་པོ་དང་། །བཤེས་གཉེན་བཟང་པོ་རབ་ཏུ་ཞི་བའི་སྟབས། །བདུད་རྩི་བདག་པོ་བཅུ་པ་ལྷུན་པོའི་འོད། །
en: Caraṇaprasanna, Ratnapriya, Dharmeśvara, “Viśvadeva, Mahāmitra, Sumitra, Praśāntagāmin, Amṛtādhipa, the tenth, Meruprabha,

source: འཕགས་པས་བསྟོད་དང་སྣང་ལྡན་གཟི་བརྗིད་འབར། །སྣང་བ་གཟིགས་དང་ལེགས་སྤྱད་རྣམ་སྨིན་དང་། །ལེགས་དགྱེས་མྱ་ངན་བྲལ་དང་རིན་ཆེན་འོད། །སྤྱོད་པར་ལྡན་དང་བཅུ་པ་བསོད་ནམས་སྟོབས། །
en: Āryastuta, Jyotiṣmat, Dīptatejas, “Avabhāsadarśin, Sucīrṇavipāka, Supriya, Vigataśoka, Ratnaprabhāsa, Cāritraka, the tenth, Puṇyabala,

source: ཡོན་ཏན་རྒྱ་མཚོ་རྨད་བྱུང་ང་རྒྱལ་སྤོང་། །བདུད་བརླག་མཛད་དང་བག་ཆགས་རྒལ་སྟབས་དང་། །མི་ཕྱེད་བློ་མངའ་རྒྱ་མཚོ་དག་མཛད་དང་། །ཚོགས་ཅན་གྲོལ་རྒྱལ་བཅུ་པ་དགའ་བའི་འོད། །
en: Guṇasāgara, Caitraka, Mānajaha, “Mārakṣayaṃkara, Vāsanottīrṇa­gati, Abhedyabuddhi, Udadhi, Śodhita, Gaṇimuktirāja, the tenth, Priyābha,

source: བྱང་ཆུབ་རྒྱལ་མཚན་ཡེ་ཤེས་རིན་ཆེན་དང་། །ཤིན་ཏུ་བསིལ་བ་ཚངས་རྒྱལ་ཡེ་ཤེས་དགྱེས། །རྫུ་འཕྲུལ་ཏོག་སྐྱེ་དབང་མཚུངས་ས་དབང་ཕྱུག །ཉི་མ་དགྱེས་དང་བཅུ་པ་སྒྲ་གཅན་ཟླ། །
en: Bodhidhvaja, Jñānaratna, “Suśītala, Brahmarāja, Jñānarata, Ṛddhiketu, Janendrakalpa, Dharaṇīśvara, Sūryapriya, the tenth, Rāhucandra,

source: མེ་ཏོག་འོད་དང་སྨན་བདག་མདངས་མངའ་དང་། །བསོད་ནམས་དགྱེས་དང་དགའ་སྟོབས་དབྱངས་སྙན་དང་། །ཆོས་ཀྱི་དབང་ཕྱུག་ཚངས་དབྱངས་སྤྱོད་བཟང་དང་། །བཅུ་པ་རྒྱལ་བ་འཁྲུལ་པ་མེད་པའི་བློ། །
en: Puṣpaprabha, Vaidyādhipa, Ojodhārin, “Puṇyapriya, Ratibala, Sughoṣa, Dharmeśvara, Brahmaruta, Suceṣṭa, The tenth, the victorious Askhalita­buddhi,

source: དབྱངས་ཆེན་སྙན་པར་གྲགས་དང་ཏོག་ལྡན་དང་། །གཟི་བརྗིད་རྣམ་གྲགས་འགྲོ་བའི་དབང་ཕྱུག་དང་། །ལྗོན་པ་གཏི་མུག་རབ་ཟད་དཔག་མེད་དང་། །ཟླ་བཟང་བཅུ་པ་སྤོབས་པ་མཐའ་ཡས་ཏོག །
en: Mahāpraṇāda, Yaśaḥkīrti, Ketumat, “Vighuṣṭatejas, Jagadīśvara, Druma, Supraṇaṣṭamoha, Amita, Sucandra, the tenth, Ananta­pratibhāna­ketu,

source: བརྟུལ་ཞུགས་བསྟར་དང་མཆོད་གནས་མྱ་ངན་རྒལ། །དགེ་དགྱེས་འགྲོ་བའི་བློ་གྲོས་དགྱེས་པར་གཤེགས། །ཞབས་མཛེས་ཨུད་པལ་དུལ་གནས་མེ་ཏོག་དང་། །བཅུ་པ་སྤོབས་པ་མཐའ་ཡས་འོད་ཟེར་ཡིན། །
en: Vratanidhi, Pūjya, Uttīrṇaśoka, “Kṣemapriya, Jagadmati, Priyaṅgama, Caraṇābhijñāta, Utpala, Puṣpa­dama­sthita, The tenth, Ananta­pratibhāna­raśmi,

source: དྲང་སྲོང་གསལ་བ་ཡོན་ཏན་བརྩོན་འགྲུས་སྙིང་། །ལྷ་བདག་རིན་ཆེན་མཐོ་གསལ་སྐལ་ཤིང་རྟ། །བསོད་ནམས་བློ་གྲོས་སྦྱིན་སྲེག་འོད་འཕྲོ་དང་། །བཅུ་པ་ཡོན་ཏན་མཐའ་ཡས་གཟི་བརྗིད་ཕུང་པོ་ཡིན། །
en: Ṛṣiprasanna, Guṇavīrya, Sāra, “Marudadhipa, Uccaratna, Prasanna, Bhāgīratha, Puṇyamati, Hutārci, The tenth, Ananta­guṇa­tejorāśi,

source: སེང་གེའི་སྟབས་དང་མི་གཡོ་རབ་གསལ་དང་། །འོད་སྤྱོད་གླུ་དབྱངས་གླུ་དབྱངས་འཁོར་ལོ་འཛིན། །དབྱིག་མཆོག་འཇིག་རྟེན་དགའ་བ་ཆོས་ཟླ་དང་། །བཅུ་པ་དགའ་བ་མཐའ་ཡས་གྲགས་ཞེས་བྱ། །
en: Siṃhavikrāmin, Acala, Prasanna, “Cīrṇaprabha, Nāgaruta, Saṃgīti, Cakradhara, Vasuśreṣṭha, Lokapriya, Dharmacandra, The tenth, Ananta­rati­kīrti,

source: སྤྲིན་ཏོག་ཤེས་རབ་འགྲོས་དང་སྤོས་བཟངས་དང་། །ནམ་མཁའི་དབྱངས་དང་ལྷ་དང་ལྷ་རྒྱལ་དང་། །ནོར་བུ་གསལ་དང་ནོར་བཟངས་སྒྲོན་མ་དང་། །བཅུ་པ་རིན་ཆེན་ང་རོའི་དབྱངས་ཞེས་བྱ། །
en: Meghadhvaja, Prajñāgati, Sugandha, “Gaganasvara, Deva, Devarāja, Maṇiviśuddha, Sudhana, Pradīpa, The tenth, Ratna­svara­ghoṣa,

source: སྐྱེ་དབང་རྒྱལ་པོ་སྒྲ་གཅན་སྦེད་པ་དང་། །དགེ་མཛད་སེང་བློ་རིན་ཆེན་གྲགས་པ་དང་། །དོན་མཛད་མཛད་མཐའ་གཟིགས་དང་སྲིད་མེ་ཏོག །མཛོད་པུ་བཅུ་པ་སྤོབས་པ་མཚུངས་མེད་རྒྱལ། །
en: Janendrarāja, Rāhugupta, “Kṣemaṃkara, Siṃhamati, Ratnayaśas, Kṛtārtha, Kṛtāntadarśin, Bhavapuṣpa, Ūrṇa, the tenth, Atula­pratibhāna­rāja,

source: ཡེ་ཤེས་རྣམ་འབྱེད་ང་རོ་སེང་མཆེ་བ། །མཛེས་གཤེགས་བསོད་ནམས་སྒྲོན་མ་བཀྲ་ཤིས་ལྡན། །ཡུལ་འཁོར་མྱ་ངན་མེད་བློ་སེམས་བློ་ལྡན། །ཆོས་སྒྲོན་སྤྱན་དང་བཅུ་པ་ཤིན་ཏུ་གཟིགས། །
en: Vibhakta­jñā­svara, Siṃhadaṃṣṭra, “Laḍitagāmin, Puṇyapradīpa, Maṅgalin, Aśokarāṣṭra, Maticintin, Matimat, Dharma­pradīpākṣa, the tenth, Sudarśana,

source: ཤུགས་འདོར་སྟོབས་ཆེན་ཤེས་རབ་མེ་ཏོག་དང་། །བརྟན་པའི་དབྱངས་དང་བདེ་ལྡན་དོན་གསུང་དང་། །དགྱེས་པ་གསལ་བ་སེང་གེའི་ཞལ་གཙུག་ཕུད། །བཅུ་པ་སེང་གེ་ཞེས་བྱ་སྣང་མཛད་འགྱུར། །
en: Vegajaha, Atibala, Prajñāpuṣpa, “Dṛḍhasvara, Sukhita, Arthavādin, Priyaprasanna, Harivaktra, Cūḍa, the tenth, And Roca, known as the Lion.

source: བསྐལ་བཟངས་འདི་ལ་སངས་རྒྱས་གང་དེ་དག །དེ་དག་གི་ནི་མཚན་རྣམས་བསྒྲགས་པ་རྣམས། །
en: “When the names of the buddhas Of the Good Eon resound,

source: འབྲས་བུ་མྱ་ངན་འདས་ཤེས་བྱ་བ་གང་། །ཉན་པ་དེ་དག་འདི་ལ་རྨོངས་མི་འགྱུར། །
en: Those who listen become free from ignorance Concerning the fruition to be known, nirvāṇa.

source: མཁས་པ་བག་ཡོད་ལྡན་པས་གུས་བགྱིས་ཏེ། །རྒྱལ་བ་འདི་དག་གི་ནི་མཚན་རྣམས་ཉོན། །
en: “Wise ones, listen to these names of the victorious ones With devotion and respect!

source: དེ་དག་གི་ནི་མཚན་རྣམས་ལེགས་ཐོས་ནས། །ངན་སོང་སྡུག་བསྔལ་ཕྱིར་ཞིང་མྱོངས་མི་འགྱུར། །
en: Those who have properly heard these names Will not experience the suffering of the lower realms in the future.

source: ཚུལ་ཁྲིམས་གནས་པ་སྡོམ་པའི་རྗེས་འཐུན་ཞིང་། །ཐོས་ལ་མོས་པས་རྟོགས་དང་ལྡན་པ་རྣམས། །ཟབ་མོའི་བཟོད་པ་ཡོངས་སུ་རྫོགས་བྱས་ནས། །འཇིག་རྟེན་མགོན་ཀུན་དེ་དག་གིས་ནི་མཐོང་། །
en: “Those who maintain discipline and adhere to the vows, Who become inspired by what they hear and gain understanding, Will reach the perfection of profound acceptance And behold these protectors of the world.

source: གང་ཞིག་མི་ཤེས་བསྐལ་པ་བྱེ་བར་ནི། །སྡིག་པའི་ལས་བྱས་ལས་འབྲས་རྣམ་སྨིན་ཀུན། །དེས་ནི་ཟད་བྱས་རྒྱལ་བ་དེ་དག་གི། །མཚན་རྣམས་བཟུང་ནས་ཀྱང་ནི་རྒྱལ་བར་འགྱུར། །
en: “For those who, out of ignorance, have engaged In unwholesome actions throughout millions of eons, The ripening of their actions will be exhausted, And they will be victorious by remembering these names of the victorious ones.

source: མདོ་སྡེ་ཁྲི་ཕྲག་དུ་མར་འཇུག་པ་དང་། །ཏིང་འཛིན་རྫུ་འཕྲུལ་སོ་སོར་ཡང་དག་རིག །སྒྲ་སྐད་དུ་མ་རྟོགས་དང་ཡེ་ཤེས་དག །ཏིང་ངེ་འཛིན་འདི་ལས་ནི་བཙལ་བར་བྱ། །
en: “Thus, by means of this absorption, Gain access to tens of thousands of discourses, Absorptions, miraculous abilities, and factors of correct understanding; Achieve knowledge of numerous languages; and accomplish wisdom.

source: འཚོ་བ་དག་པ་གཡོ་ནི་མེད་པ་དང་། །རྣམ་སྨིན་ཤེས་དང་ཕྲག་དོག་མེད་པ་དང་། །བསྡུ་བ་དང་ནི་གཟུངས་ལ་བརྩོན་པ་ཡིས། །ཏིང་འཛིན་འདི་ནི་རབ་ཏུ་ཤེས་པར་བྱ། །
en: “Living by pure means and without deceit, With knowledge of karmic ripening and free from envy, Endeavor in the means of attraction and the retentions, So that you may fully understand this absorption.”

source: བཅོམ་ལྡན་འདས་དེ་ནི་ལེགས་ལགས་ཏེ།
en: “Blessed One, this is excellent.

source: ལྷ་དང་མི་རྣམས་དང་སྐྱེ་བོ་མང་པོ་ལ་སྨན་པ་དང་། སྐྱེ་བོ་མང་པོ་ལ་བདེ་བར་གྱུར་པ་དེ་དང་། མ་འོངས་པ་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་ཐོས་ན་ཡང་ཕྱིར་ཞིང་། འདུན་པར་འགྱུར་བ་དང་། དམ་པའི་ཆོས་ལ་ཆེས་ཁྱད་པར་དུ་འཕགས་པར་སྨོན་པར་འགྱུར་བ་དང་། ཕྱིར་ཞིང་སྣང་བར་བགྱིས་པར་འགྱུར་བའི་སླད་དུ། བསྐལ་པ་བཟང་པོའི་སངས་རྒྱས་དེ་དག་གི་ཡུལ་དང་། རིགས་དང་། འོད་དང་། ཡབ་དང་། ཡུམ་དང་། སྲས་དང་། རིམ་གྲོ་པ་དང་། མཆོག་གི་ཟུང་དང་། བཟང་པོའི་ཟུང་དང་། དགེ་སློང་གི་དགེ་འདུན་ཕུན་སུམ་ཚོགས་པ་དང་། སྐུ་ཚེའི་ཚད་དང་། དམ་པའི་ཆོས་གནས་པ་དང་། སྐུ་གདུང་འཕེལ་བར་འགྱུར་བ་དག་བཅོམ་ལྡན་འདས་ཀྱིས་བཤད་དུ་གསོལ།
en: Blessed One, for the benefit of gods and humans, please explain about the birthplace, the family, the light, the father, the mother, the son, the attendant, the two foremost and excellent followers, the perfect community of monks, the lifespan, the duration of the sacred Dharma, and the manifestation of relics that pertain to each of these buddhas of the Good Eon, so that numerous beings may receive healing and be happy, and so that bodhisattvas of the future may persevere in hearing and remain inspired, become exceptionally accomplished in the sacred Dharma, and become sources of insight.”
